GopalSaraf/Practicals/PSDL/include/proc/pic16lf19176.inc
// Register: ALRMSEC
#define ALRMSEC ALRMSEC
ALRMSEC                                  equ 0C1Ch
// bitfield definitions
ALRMSEC_ALRMLSEC_POSN                    equ 0000h
ALRMSEC_ALRMLSEC_POSITION                equ 0000h
ALRMSEC_ALRMLSEC_SIZE                    equ 0004h
ALRMSEC_ALRMLSEC_LENGTH                  equ 0004h
ALRMSEC_ALRMLSEC_MASK                    equ 000Fh
ALRMSEC_ALRMHSEC_POSN                    equ 0004h
ALRMSEC_ALRMHSEC_POSITION                equ 0004h
ALRMSEC_ALRMHSEC_SIZE                    equ 0003h
ALRMSEC_ALRMHSEC_LENGTH                  equ 0003h
ALRMSEC_ALRMHSEC_MASK                    equ 0070h
ALRMSEC_ALRMLSEC0_POSN                   equ 0000h
ALRMSEC_ALRMLSEC0_POSITION               equ 0000h
ALRMSEC_ALRMLSEC0_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC0_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC0_MASK                   equ 0001h
ALRMSEC_ALRMLSEC1_POSN                   equ 0001h
ALRMSEC_ALRMLSEC1_POSITION               equ 0001h
ALRMSEC_ALRMLSEC1_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC1_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC1_MASK                   equ 0002h
ALRMSEC_ALRMLSEC2_POSN                   equ 0002h
ALRMSEC_ALRMLSEC2_POSITION               equ 0002h
ALRMSEC_ALRMLSEC2_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC2_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC2_MASK                   equ 0004h
ALRMSEC_ALRMLSEC3_POSN                   equ 0003h
ALRMSEC_ALRMLSEC3_POSITION               equ 0003h
ALRMSEC_ALRMLSEC3_SIZE                   equ 0001h
ALRMSEC_ALRMLSEC3_LENGTH                 equ 0001h
ALRMSEC_ALRMLSEC3_MASK                   equ 0008h
ALRMSEC_ALRMHSEC0_POSN                   equ 0004h
ALRMSEC_ALRMHSEC0_POSITION               equ 0004h
ALRMSEC_ALRMHSEC0_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC0_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC0_MASK                   equ 0010h
ALRMSEC_ALRMHSEC1_POSN                   equ 0005h
ALRMSEC_ALRMHSEC1_POSITION               equ 0005h
ALRMSEC_ALRMHSEC1_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC1_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC1_MASK                   equ 0020h
ALRMSEC_ALRMHSEC2_POSN                   equ 0006h
ALRMSEC_ALRMHSEC2_POSITION               equ 0006h
ALRMSEC_ALRMHSEC2_SIZE                   equ 0001h
ALRMSEC_ALRMHSEC2_LENGTH                 equ 0001h
ALRMSEC_ALRMHSEC2_MASK                   equ 0040h

// Register: VB0GPR
#define VB0GPR VB0GPR
VB0GPR                                   equ 0E8Ch
// bitfield definitions
VB0GPR_VB0GPR_POSN                       equ 0000h
VB0GPR_VB0GPR_POSITION                   equ 0000h
VB0GPR_VB0GPR_SIZE                       equ 0008h
VB0GPR_VB0GPR_LENGTH                     equ 0008h
VB0GPR_VB0GPR_MASK                       equ 00FFh
VB0GPR_VB0GPR0_POSN                      equ 0000h
VB0GPR_VB0GPR0_POSITION                  equ 0000h
VB0GPR_VB0GPR0_SIZE                      equ 0001h
VB0GPR_VB0GPR0_LENGTH                    equ 0001h
VB0GPR_VB0GPR0_MASK                      equ 0001h
VB0GPR_VB0GPR1_POSN                      equ 0001h
VB0GPR_VB0GPR1_POSITION                  equ 0001h
VB0GPR_VB0GPR1_SIZE                      equ 0001h
VB0GPR_VB0GPR1_LENGTH                    equ 0001h
VB0GPR_VB0GPR1_MASK                      equ 0002h
VB0GPR_VB0GPR2_POSN                      equ 0002h
VB0GPR_VB0GPR2_POSITION                  equ 0002h
VB0GPR_VB0GPR2_SIZE                      equ 0001h
VB0GPR_VB0GPR2_LENGTH                    equ 0001h
VB0GPR_VB0GPR2_MASK                      equ 0004h
VB0GPR_VB0GPR3_POSN                      equ 0003h
VB0GPR_VB0GPR3_POSITION                  equ 0003h
VB0GPR_VB0GPR3_SIZE                      equ 0001h
VB0GPR_VB0GPR3_LENGTH                    equ 0001h
VB0GPR_VB0GPR3_MASK                      equ 0008h
VB0GPR_VB0GPR4_POSN                      equ 0004h
VB0GPR_VB0GPR4_POSITION                  equ 0004h
VB0GPR_VB0GPR4_SIZE                      equ 0001h
VB0GPR_VB0GPR4_LENGTH                    equ 0001h
VB0GPR_VB0GPR4_MASK                      equ 0010h
VB0GPR_VB0GPR5_POSN                      equ 0005h
VB0GPR_VB0GPR5_POSITION                  equ 0005h
VB0GPR_VB0GPR5_SIZE                      equ 0001h
VB0GPR_VB0GPR5_LENGTH                    equ 0001h
VB0GPR_VB0GPR5_MASK                      equ 0020h
VB0GPR_VB0GPR6_POSN                      equ 0006h
VB0GPR_VB0GPR6_POSITION                  equ 0006h
VB0GPR_VB0GPR6_SIZE                      equ 0001h
VB0GPR_VB0GPR6_LENGTH                    equ 0001h
VB0GPR_VB0GPR6_MASK                      equ 0040h
VB0GPR_VB0GPR7_POSN                      equ 0007h
VB0GPR_VB0GPR7_POSITION                  equ 0007h
VB0GPR_VB0GPR7_SIZE                      equ 0001h
VB0GPR_VB0GPR7_LENGTH                    equ 0001h
VB0GPR_VB0GPR7_MASK                      equ 0080h

// Register: VB1GPR
#define VB1GPR VB1GPR
VB1GPR                                   equ 0E8Dh
// bitfield definitions
VB1GPR_VB1GPR_POSN                       equ 0000h
VB1GPR_VB1GPR_POSITION                   equ 0000h
VB1GPR_VB1GPR_SIZE                       equ 0008h
VB1GPR_VB1GPR_LENGTH                     equ 0008h
VB1GPR_VB1GPR_MASK                       equ 00FFh
VB1GPR_VB1GPR0_POSN                      equ 0000h
VB1GPR_VB1GPR0_POSITION                  equ 0000h
VB1GPR_VB1GPR0_SIZE                      equ 0001h
VB1GPR_VB1GPR0_LENGTH                    equ 0001h
VB1GPR_VB1GPR0_MASK                      equ 0001h
VB1GPR_VB1GPR1_POSN                      equ 0001h
VB1GPR_VB1GPR1_POSITION                  equ 0001h
VB1GPR_VB1GPR1_SIZE                      equ 0001h
VB1GPR_VB1GPR1_LENGTH                    equ 0001h
VB1GPR_VB1GPR1_MASK                      equ 0002h
VB1GPR_VB1GPR2_POSN                      equ 0002h
VB1GPR_VB1GPR2_POSITION                  equ 0002h
VB1GPR_VB1GPR2_SIZE                      equ 0001h
VB1GPR_VB1GPR2_LENGTH                    equ 0001h
VB1GPR_VB1GPR2_MASK                      equ 0004h
VB1GPR_VB1GPR3_POSN                      equ 0003h
VB1GPR_VB1GPR3_POSITION                  equ 0003h
VB1GPR_VB1GPR3_SIZE                      equ 0001h
VB1GPR_VB1GPR3_LENGTH                    equ 0001h
VB1GPR_VB1GPR3_MASK                      equ 0008h
VB1GPR_VB1GPR4_POSN                      equ 0004h
VB1GPR_VB1GPR4_POSITION                  equ 0004h
VB1GPR_VB1GPR4_SIZE                      equ 0001h
VB1GPR_VB1GPR4_LENGTH                    equ 0001h
VB1GPR_VB1GPR4_MASK                      equ 0010h
VB1GPR_VB1GPR5_POSN                      equ 0005h
VB1GPR_VB1GPR5_POSITION                  equ 0005h
VB1GPR_VB1GPR5_SIZE                      equ 0001h
VB1GPR_VB1GPR5_LENGTH                    equ 0001h
VB1GPR_VB1GPR5_MASK                      equ 0020h
VB1GPR_VB1GPR6_POSN                      equ 0006h
VB1GPR_VB1GPR6_POSITION                  equ 0006h
VB1GPR_VB1GPR6_SIZE                      equ 0001h
VB1GPR_VB1GPR6_LENGTH                    equ 0001h
VB1GPR_VB1GPR6_MASK                      equ 0040h
VB1GPR_VB1GPR7_POSN                      equ 0007h
VB1GPR_VB1GPR7_POSITION                  equ 0007h
VB1GPR_VB1GPR7_SIZE                      equ 0001h
VB1GPR_VB1GPR7_LENGTH                    equ 0001h
VB1GPR_VB1GPR7_MASK                      equ 0080h

